app/controllers/clothes_controller.rb

    def index
        clothes = Clothes.all
---
SELECT "clothes".* FROM "clothes"