app/controllers/wishlists_controller.rb

    def index
      @wishlists = Wishlist.all
---
SELECT "wishlists".* FROM "wishlists"

    def create
      @wishlist = Wishlist.new(wishlist_params)

      if @wishlist.save
        render json: Wishlist.all, status: :created, location: @wishlist
---
INSERT INTO "wishlists" ("userId") VALUES ($1) RETURNING "id"  [["userId", "jmEAuYER8NP8gNBoLWV8No4ue9J3"]]
SELECT "wishlists".* FROM "wishlists"